# WoodCurlyDistortionMap Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodCurlyDistortionMap Property
AdvancedWood Class See Also
---
The property labeled "The 2D fiber distortion map (NO degamma op)" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodCurlyDistortionMap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodCurlyDistortionMap As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodCurlyDistortionMap {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble". This property allows a connected asset.
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace